#include "UnitTests.h"
#if not ENABLE_UNIT_TESTS

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#include <stdio.h>
#include <Windows.h>

#include "Modules/Logs/Logs.h"
#include "Back end/x86/x86CompilerUnitTests.h"

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	if (LogsConstructor() != LogError::NoErrors)
	{
		puts("Ошибка открытия файла логов.");
		return 1;
	}

	LogsDestructor();
	return 0;
}

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif //!(not ENABLE_UNIT_TESTS)