#ifndef TEXT_H
#define TEXT_H

#include <stdio.h>

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

struct Text
{
	/// Размер текста.
	size_t Size;
	/// Указатель на начало текста. Текст должен заканчиваться '\0'
	char*  Data;
};

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

/**
 * @brief Конструктор текста.
 * 
 * @param text Указатель на структуру Text.
 * 
 * @return ProgramStatus.
*/
int TextConstructor(Text* text);

/**
 * @brief          Прочитать файл.
 *
 * @param text     Указатель на структуру Text.
 * @param fileName Имя файла.
 * 
 * @return ProgramStatus.
*/
int TextReadFile(Text* text, const char* fileName);

/**
 * @brief Деструктор текста. Очищает всю структуру.
 * 
 * @param text Указатель на структуру Text.
*/
void TextDestructor(Text* text);

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

#endif // !TEXT_H