///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль синтаксического анализатора.
// 
// Версия: 1.0.1.0
// Дата последнего изменения: 13:08 30.01.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#ifndef PARSER_H
#define PARSER_H

#include "Lexer/Lexer.h"
#include "../AST/AST.h"

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

/// Особые ситуации при работе модуля синтаксического анализатора.
enum class ParserError
{
	/// Нет ошибок.
	NoErrors,
	/// Последовательность лексем не является допустимой синтаксической конструкцией.
	SyntaxError,
};

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

ParserError ParserParseFile(Lexer* const lexer, AST* const outAst);

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif // !PARSER_H