#include "List.h"

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

/// true, если элемент списка €вл€етс€ пустым.
#define CHECK_FREE_ELEM(list, dataIndex) \
    ((dataIndex) != (list)->Head && (list)->Nodes[(dataIndex)].Prev == 0)

/// ѕолучить индекс свободно места в списке.
/// ѕредварительно нужно проверить, что список не полон.
#define FIND_EMPTY_PLACE(list) \
    (list)->Free

/// true, если список полон.
#define CHECK_LIST_FULL(list) \
    (list)->Size == (list)->Capacity

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\