///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль для создания файлов-логов работы программы.
// 
// Добавьте этот файл с помощью #include в .cpp, чтобы отключить функции логирования
// внутри .cpp файла. Добавлять нужно после директивы #include "Logs.h".
// 
// Версия: 1.0.0.0
// Дата последнего изменения: 13:58 28.01.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#ifndef DISABLE_LOGS_H
#define DISABLE_LOGS_H

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#undef LogLine
#undef LogFLine
#undef LogTrace
#undef LogBeginDump
#undef LogEndDump
#undef LogAddImage

#define LogLine(...) 
#define LogFLine(...)
#define LogTrace(...)
#define LogBeginDump(...)
#define LogEndDump(...)
#define LogAddImage(...)

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif // !DISABLE_LOGS_H