#ifndef ERRORS_HAMDLING_H
#define ERRORS_HAMDLING_H

//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 
//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 

enum class ProgramStatus
{
	/// Функция успешно завершила свою работу
	Ok = 0,

	/// Предупреждение. Странное, но не критичная ситуация выполнения.
	Warning = 1,

	/// Ошибка в модуле. Сильно нарушает работу программы.
	/// Либо модуль отключается, и выполнение продолжается.
	/// Либо работа программы завершается.
	Error = 2,

	/// Критическая ошибка. Необходимо завершить выполнения программы.
	Fault = 3,

	/// Ещё не реализовано.
	NotImplemented = 4
};

//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 
//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 

#endif // !ERRORS_HAMDLING_H