#ifndef ERRORS_HAMDLING_H
#define ERRORS_HAMDLING_H

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

enum ProgramStatus
{
	/// Функция успешно завершила свою работу
	PROGRAM_NO_ERRORS = 0,

	/// Предупреждение. Странное, но не критичная ситуация выполнения.
	PROGRAM_WARNING   = 1,

	/// Ошибка в модуле. Сильно нарушает работу программы.
	/// Либо модуль отключается, и выполнение продолжается.
	/// Либо работа программы завершается.
	PROGRAM_ERROR     = 2,

	/// Критическая ошибка. Необходимо завершить выполнения программы.
	PROGRAM_FAULT     = 3
};

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

#endif // !ERRORS_HAMDLING_H