///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль обработки ошибок программы.
// 
// Версия: 1.0.0.0
// Дата последнего изменения: 12:37 28.01.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\

#ifndef ERRORS_HAMDLING_H
#define ERRORS_HAMDLING_H

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

enum class ProgramStatus
{
	/// Функция успешно завершила свою работу
	Ok = 0,

	/// Предупреждение. Возникла не критическая особая ситуация во время выполнения программы.
	Warning = 1,

	/// Ошибка в модуле. Сильно нарушает работу программы.
	/// Либо модуль отключается, и выполнение продолжается.
	/// Либо работа программы завершается.
	Error = 2,

	/// Критическая ошибка. Необходимо завершить выполнения программы.
	Fault = 3,

	/// Ещё не реализовано.
	NotImplemented = 4
};

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif // !ERRORS_HAMDLING_H