///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль работы с файловой системой.
// 
// Использование:
// 1. Добавить директорию "Modules/FilesIO" в проект.
// 
// 2. Подключить заголовочный файл "FilesIO.h".
// 
// 3. Доступные функции (параметры и описание см. ниже):
//     4.1.  DirectoryExist
//     4.2.  GetFileSize
// 
// Версия: 1.0.0.0
// Дата последнего изменения: 12:02 28.01.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#ifndef FILES_IO_H
#define FILES_IO_H

#include <stdio.h>

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

/**
 * @brief  Проверяет, существует ли директория.
 *
 * @param path Путь к директории.
 *
 * @return true, если директория существует.
*/
bool DirectoryExist(const char* const path);

/**
 * @brief  Получить размер файла.
 *
 * @param file Указатель на открытый файл.
 *
 * @return Размер файла.
*/
size_t GetFileSize(FILE* const file);

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif // !FILES_IO_H