///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль компилятора в архитектуру Intel x86 (32-разрядная). 
// 
// Конфигурация встроенных в язык функций.
//
// Версия: 1.0.0.0
// Дата последнего изменения: 19:47 13.02.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#ifndef INTRINSIC_FUNCTIONS_H
#define INTRINSIC_FUNCTIONS_H

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

/// Структура описывающая встроенную функцию.
struct IntrinsicFunction
{
	/// Имя функции.
	const char* Name;
	/// Длина имени.
	size_t      NameSize;
};

/// Функция квадратного корня.
static const IntrinsicFunction IntrinSqrt = {"sqrt", sizeof("sqrt") - 1};

/// Функция преобразования числа с плавающей точкой в целое. 
static const IntrinsicFunction IntrinInt = {"int", sizeof("int") - 1};

/// Функция вывода в консоль светлого пикселя ('*'). 
static const IntrinsicFunction IntrinLight = {"light", sizeof("light") - 1};

/// Функция вывода в консоль темного пикселя (' '). 
static const IntrinsicFunction IntrinDark = {"dark", sizeof("dark") - 1};

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#endif // !INTRINSIC_FUNCTIONS_H