#ifndef LOGS_CONFIG_H
#define LOGS_CONFIG_H

#include "Logs.h"

//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 
//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 

// Папка, в которой создаются логи.
#define LOGS_FOLDER "_logs\\"

#ifdef _DEBUG
#define LOG_GLOBAL_DUBLICATE_TO_CONSOLE true
#else
#define LOG_GLOBAL_DUBLICATE_TO_CONSOLE true
#endif

// Глобальные настройки трассировки.
// Чтобы выключить трассировку, нужно закомментировать один из дефайнов.

/// Конструкторы / деструкторы. 
//#define LOG_CFG_GLOBAL_TRACE_CTOR true

/// Основные функции работы модуля.
/// Обычно располагаются в <ModuleName>.cpp.
//#define LOG_CFG_GLOBAL_TRACE_FUNC_0 true

/// Второстепенные функции модуля.
/// Располагаются в вспомогательных файлах модуля.
//#define LOG_CFG_GLOBAL_TRACE_FUNC_1 true

/// Вспомогательные функции модуля.
/// Часто вызываются, поэтому могут замусорить файл логов.
//#define LOG_CFG_GLOBAL_TRACE_FUNC_2 true

/// Верификаторы, дампы.
//#define LOG_CFG_GLOBAL_TRACE_VERIFY true

//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 
//***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\ 

#endif // !LOGS_CONFIG_H